tutorials/lagrangian/porousExplicitSourceReactingParcelFoam/filter/system/cellSetDict
/*------------------------------*- FOAMDict -*-------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.7.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      cellSetDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

name filter;

action new;

topoSetSources
(
    // Cells with cell centre within box
    boxToCell
    {
       box   (1.5 -1 -1) (2 1 1);
    }
);

// ****************** vim: set ft=foamdict sw=4 sts=4 et: ****************** //
